#include "JSystem/JParticle/MultiEmitterCallBack.hpp"
#include "Game/Player/MarioEffect.hpp"
#include "Game/Effect/MultiEmitter.hpp"
#include "Game/Effect/ParticleEmitter.hpp"
#include "Game/LiveActor/EffectKeeper.hpp"
#include "Game/LiveActor/ModelObj.hpp"
#include "Game/Player/Mario.hpp"
#include "Game/Player/MarioActor.hpp"
#include "Game/Player/MarioSwim.hpp"
#include "Game/Util/AreaObjUtil.hpp"
#include "Game/Util/DemoUtil.hpp"
#include "Game/Util/EffectUtil.hpp"
#include "Game/Util/EventUtil.hpp"
#include "Game/Util/HashUtil.hpp"
#include "Game/Util/JointUtil.hpp"
#include "Game/Util/LiveActorUtil.hpp"
#include "Game/Util/MapUtil.hpp"
#include "Game/Util/MathUtil.hpp"
#include "Game/Util/MtxUtil.hpp"
#include "Game/Util/SoundUtil.hpp"
#include "Game/Map/HitInfo.hpp"
#include "JSystem/JParticle/JPAEmitter.hpp"
#include "JSystem/JParticle/JPAMath.hpp"
#include <cstdio>
#include <cstring>

struct MaterialEffectEntry {
    union FlagWord {
        u32 mWord;
        struct {
            u8 mByte0;
            u8 mByte1;
            u8 mByte2;
            u8 mByte3;
        };
    };

    /* 0x00 */ const char* mName;
    /* 0x04 */ FlagWord mFlag;
    /* 0x08 */ const char* mEffects[7];
    /* 0x24 */ const char* mCurrent;
    /* 0x28 */ MultiEmitter* mEmitter;
};

struct SmokeEffectEntry {
    union FlagWord {
        u32 mWord;
        struct {
            u8 mByte0;
            u8 mByte1;
            u8 mByte2;
            u8 mByte3;
        };
    };

    /* 0x00 */ const char* mName;
    /* 0x04 */ FlagWord mType;
    /* 0x08 */ f32 mScale;
    /* 0x0C */ f32 mRate;
    /* 0x10 */ FlagWord mFlags;
    /* 0x14 */ u16 mInterval;
    /* 0x16 */ u16 mTimer;
    /* 0x18 */ u32 mHash;
    /* 0x1C */ MultiEmitter* mEmitter;
    /* 0x20 */ u8 mMaterial;
    /* 0x21 */ u8 _21[3];
};

MaterialEffectEntry cMaterialEffectTable[] = {
    { "属性尻ドロップ", 0x00000000, { "HipDropSmoke", "HipDropWater", "HipDropFlower", "HipDropSand", "HipDropSnow", "MudCircle", "HoneyCircle" }, nullptr, nullptr },
    { "属性ハチ風", 0x03000000, { "Hovering", "HoveringWater", "Hovering", "Hovering", "Hovering", "Hovering", "Hovering" }, nullptr, nullptr },
    { "属性スピン", 0x00000000, { nullptr, "WaterSpin", "FlowerSpin", "SandSpin", "SnowSpin", "MudCircle", "HoneyCircle" }, nullptr, nullptr },
    { "属性ステージイン", 0x00000000, { "StageStartGroundSmoke", nullptr, nullptr, "StageStartGroundSand", nullptr, nullptr, nullptr }, nullptr, nullptr },
    { nullptr, 0, { nullptr, nullptr, nullptr, nullptr, nullptr, nullptr, nullptr }, nullptr, nullptr }
};

SmokeEffectEntry cSmokeTable[] = {
    { "共通着地普通", 0x08000000, 1.0f, 1.0f, 0x00000400, 0, 0, 0, nullptr, 0, { 0, 0, 0 } },
    { "共通着地大", 0x03000000, 1.5f, 1.0f, 0x00000400, 0, 0, 0, nullptr, 0, { 0, 0, 0 } },
