#include "JSystem/JParticle/MultiEmitterCallBack.hpp"
#include "Game/Player/MarioEffect.hpp"
#include "Game/Effect/MultiEmitter.hpp"
#include "Game/Effect/ParticleEmitter.hpp"
#include "Game/LiveActor/EffectKeeper.hpp"
#include "Game/LiveActor/ModelObj.hpp"
#include "Game/Player/Mario.hpp"
#include "Game/Player/MarioActor.hpp"
#include "Game/Player/MarioSwim.hpp"
#include "Game/Util/AreaObjUtil.hpp"
#include "Game/Util/DemoUtil.hpp"
#include "Game/Util/EffectUtil.hpp"
#include "Game/Util/EventUtil.hpp"
#include "Game/Util/HashUtil.hpp"
#include "Game/Util/JointUtil.hpp"
#include "Game/Util/LiveActorUtil.hpp"
#include "Game/Util/MapUtil.hpp"
#include "Game/Util/MathUtil.hpp"
#include "Game/Util/MtxUtil.hpp"
#include "Game/Map/HitInfo.hpp"
#include "JSystem/JParticle/JPAEmitter.hpp"
#include <cstdio>
#include <cstring>

extern "C" void JPASetRMtxTVecfromMtx(const Mtx, Mtx, TVec3f*);

namespace MR {
    bool isPermitSE();
}

extern char lbl_805C6A30[];
extern char lbl_805C6A3F[];
extern char lbl_805C6A4C[];
extern char lbl_805C6A59[];
extern char lbl_805C6A67[];
extern char lbl_805C6A73[];
extern char lbl_805C6A7F[];
extern char lbl_805C6A89[];
extern char lbl_805C6A95[];
extern char lbl_805C6AA0[];
extern char lbl_805C6AA9[];
extern char lbl_805C6AB7[];
extern char lbl_805C6AC2[];
extern char lbl_805C6ACC[];
extern char lbl_805C6AD7[];
extern char lbl_805C6AE0[];
extern char lbl_805C6AE9[];
extern char lbl_805C6AFA[];
extern char lbl_805C6B10[];

struct MaterialEffectEntry {
    /* 0x00 */ const char* mName;
    /* 0x04 */ u32 mFlag;
    /* 0x08 */ const char* mEffects[7];
    /* 0x24 */ const char* mCurrent;
    /* 0x28 */ MultiEmitter* mEmitter;
};

struct SmokeEffectEntry {
    /* 0x00 */ const char* mName;
    /* 0x04 */ u32 mType;
    /* 0x08 */ f32 mScale;
    /* 0x0C */ f32 mRate;
    /* 0x10 */ u32 mFlags;
    /* 0x14 */ u16 mInterval;
    /* 0x16 */ u16 mTimer;
    /* 0x18 */ u32 mHash;
    /* 0x1C */ MultiEmitter* mEmitter;
    /* 0x20 */ u8 mMaterial;
    /* 0x21 */ u8 _21[3];
};

char lbl_806B22A0[] = "%s";
char lbl_806B22A3[] = "Ice";

MaterialEffectEntry cMaterialEffectTable[] = {
    { lbl_805C6A30, 0x00000000, { lbl_805C6A3F, lbl_805C6A4C, lbl_805C6A59, lbl_805C6A67, lbl_805C6A73, lbl_805C6A7F, lbl_805C6A89 }, nullptr, nullptr },
    { lbl_805C6A95, 0x03000000, { lbl_805C6AA0, lbl_805C6AA9, lbl_805C6AA0, lbl_805C6AA0, lbl_805C6AA0, lbl_805C6AA0, lbl_805C6AA0 }, nullptr, nullptr },
    { lbl_805C6AB7, 0x00000000, { nullptr, lbl_805C6AC2, lbl_805C6ACC, lbl_805C6AD7, lbl_805C6AE0, lbl_805C6A7F, lbl_805C6A89 }, nullptr, nullptr },
    { lbl_805C6AE9, 0x00000000, { lbl_805C6AFA, nullptr, nullptr, lbl_805C6B10, nullptr, nullptr, nullptr }, nullptr, nullptr },
    { nullptr, 0, { nullptr, nullptr, nullptr, nullptr, nullptr, nullptr, nullptr }, nullptr, nullptr }
};

char lbl_805C6C04[] = "Honey";
char lbl_805C6C0A[] = "Sand";

char lbl_805C6C64[] = {
    0x8B, 0xA4, 0x92, 0xCA, 0x92, 0x85, 0x92, 0x6E, 0x95, 0x81, 0x92, 0xCA, 0x00
};

