#pragma once

#include "Game/Boss/DodoryuStateBase.hpp"
#include <JSystem/JGeometry/TMatrix.hpp>

struct DodoryuAnimSet {
    /* 0x00 */ const char* mBckName;
    /* 0x04 */ const char* mBtkName;
    /* 0x08 */ const char* mBrkName;
    /* 0x0C */ const char* mBvaName;
    /* 0x10 */ const char* mLeadHillBckName;
};

struct DodoryuChaseParam {
    /* 0x000 */ s32 mReadyChaseStep;
    /* 0x004 */ f32 _4;
    /* 0x008 */ f32 _8;
    /* 0x00C */ f32 _C;
    /* 0x010 */ f32 _10;
    /* 0x014 */ f32 _14;
    /* 0x018 */ s32 mAppearSignStep;
    /* 0x01C */ f32 _1C;
    /* 0x020 */ f32 _20;
    /* 0x024 */ f32 _24;
    /* 0x028 */ f32 _28;
    /* 0x02C */ s32 mReadyAppearStepMin;
    /* 0x030 */ s32 mReadyAppearStepMax;
    /* 0x034 */ f32 _34;
    /* 0x038 */ f32 _38;
    /* 0x03C */ f32 _3C;
    /* 0x040 */ f32 _40;
    /* 0x044 */ f32 _44;
    /* 0x048 */ f32 _48;
    /* 0x04C */ s32 mChaseAppearStepMin;
    /* 0x050 */ s32 mChaseAppearStepMax;
    /* 0x054 */ s32 mChaseAppearEndStep;
    /* 0x058 */ s32 _58;
    /* 0x05C */ f32 _5C;
    /* 0x060 */ s32 _60;
    /* 0x064 */ s32 _64;
    /* 0x068 */ f32 _68;
    /* 0x06C */ f32 _6C;
    /* 0x070 */ f32 _70;
    /* 0x074 */ s32 _74;
    /* 0x078 */ s32 mLaughStep;
    /* 0x07C */ s32 mFindPosStepMin;
    /* 0x080 */ s32 mFindPosStepMax;
    /* 0x084 */ f32 _84;
    /* 0x088 */ f32 _88;
    /* 0x08C */ f32 _8C;
    /* 0x090 */ s32 _90;
    /* 0x094 */ s32 mKnockDownStep;
    /* 0x098 */ u32 _98;
    /* 0x09C */ bool _9C;
    /* 0x0A0 */ f32 _A0;
    /* 0x0A4 */ f32 _A4;
    /* 0x0A8 */ f32 _A8;
    /* 0x0AC */ f32 _AC;
    /* 0x0B0 */ s32 mChaseMoreStep;
    /* 0x0B4 */ f32 _B4;
    /* 0x0B8 */ f32 _B8;
    /* 0x0BC */ s32 mChaseMoreAccelCounterMin;
    /* 0x0C0 */ s32 mChaseMoreAccelCounterMax;
    /* 0x0C4 */ s32 mChaseMoreBrakeCounterMin;
    /* 0x0C8 */ s32 mChaseMoreBrakeCounterMax;
    /* 0x0CC */ DodoryuAnimSet mAnimSetStart;
    /* 0x0E0 */ DodoryuAnimSet _E0;
    /* 0x0F4 */ DodoryuAnimSet _F4;
    /* 0x108 */ DodoryuAnimSet mAnimSetReadyAppear;
    /* 0x11C */ DodoryuAnimSet _11C;
    /* 0x130 */ DodoryuAnimSet mAnimSetChaseHide;
    /* 0x144 */ DodoryuAnimSet mAnimSetChaseAppearStart;
    /* 0x158 */ DodoryuAnimSet mAnimSetChaseAppear;
    /* 0x16C */ DodoryuAnimSet mAnimSetChaseAppearEnd;
    /* 0x180 */ DodoryuAnimSet mAnimSetJumpOut;
    /* 0x194 */ DodoryuAnimSet mAnimSetEscape;
    /* 0x1A8 */ DodoryuAnimSet mAnimSetRecover;
    /* 0x1BC */ DodoryuAnimSet mAnimSetDive;
    /* 0x1D0 */ DodoryuAnimSet mAnimSetKnockDown;
    /* 0x1E4 */ DodoryuAnimSet mAnimSetLaugh;
    /* 0x1F8 */ DodoryuAnimSet mAnimSetLaughEnd;
    /* 0x20C */ DodoryuAnimSet _20C;
    /* 0x220 */ DodoryuAnimSet mAnimSetChaseMoreStart;
    /* 0x234 */ DodoryuAnimSet mAnimSetChaseMore;
    /* 0x248 */ DodoryuAnimSet mAnimSetChaseMoreEnd;
};

class DodoryuStateLv2 : public DodoryuStateBase {
public:
    DodoryuStateLv2(Dodoryu* pHost, DodoryuChaseParam* pChaseParam, const char* pName);

    virtual void init(const JMapInfoIter& rIter);
    virtual void control();

    virtual void start();
    virtual void catchAttackSensor(HitSensor*, HitSensor*);
    virtual void catchHipDrop();
    virtual bool catchPlayerAttack(u32, HitSensor*, HitSensor*);
    virtual void catchStartClipped();
    virtual void catchSendPlayerFlying(HitSensor*, HitSensor*);

    void knockOver();
    bool isEnableToCatchHipDrop() const;
    bool isDown() const;
    bool isAttackableNerve() const;
    bool tryShiftToChaseAppear();
    bool tryShiftToChaseAppearEnd();
    bool isEscapeEnd() const;
    void updateReadyChaseShake();
    void updateChaseHideShake();
    void updateHideShake();
    void updateDiveShake();
    void calcRandomVelocity(s32);
    void keepVerticalizedVelocity();
    void attackStrongToDir(HitSensor*, HitSensor*);
    void hideJump();
    bool tryToShiftAppearSign();
    void determinChaseMoreAccelCounter();
    void determinChaseMoreBrakeCounter();
    void turnToward(const TVec3f&, f32);
    void addVelocity(bool);
    void calcLimitedRotateMtx(TPos3f*, const TVec3f&, const TVec3f&, f32);
    bool isReflectSpinAttack() const;
    void shiftChaseUnderground();
    void shiftChaseExposingHead();
    void shiftChaseExposingBust();
    void shiftChaseInAnger();
    void shiftHideAttack();
    void startAnim(const DodoryuAnimSet&);
    void startBtk(const DodoryuAnimSet&);
    void startBrk(const DodoryuAnimSet&);
    void startBva(const DodoryuAnimSet&);
    void startLeadHillBck(const DodoryuAnimSet&);

    void exeStart();
    void endStart();
    void exeReadyChase();
    void endReadyChase();
    void exeChaseHide();
    void endChaseHide();
    void exeReadyAppear();
    void endReadyAppear();
    void exeAppearSign();
    void exeChaseAppearStart();
    void endChaseAppearStart();
    void exeChaseAppear();
    void endChaseAppear();
    void exeChaseAppearEnd();
    void endChaseAppearEnd();
    void exeJumpOut();
    void exeEscape();
    void endEscape();
    void exeEscapeJump();
    void endEscapeJump();
    void exeRecover();
    void exeDive();
    void endDive();
    void exeKnockDown();
    void exeLaugh();
    void exeLaughEnd();
    void endLaughEnd();
    void exeFindPos();
    void exeHideAttack();
    void exeChaseMoreStart();
    void exeChaseMore();
    void endChaseMore();
    void exeChaseMoreEnd();

    /* 0x90 */ u32 _90;
    /* 0x94 */ TVec3f _94;
    /* 0xA0 */ TVec3f _A0;
    /* 0xAC */ TVec3f _AC;
    /* 0xB8 */ s32 mReadyAppearStep;
    /* 0xBC */ s32 mChaseAppearStep;
    /* 0xC0 */ s32 mChaseAppearEndCounter;
    /* 0xC4 */ u32 _C4;
    /* 0xC8 */ s32 _C8;
    /* 0xCC */ s32 _CC;
    /* 0xD0 */ TVec3f _D0;
    /* 0xDC */ s32 mFindPosStep;
    /* 0xE0 */ s32 mChaseMoreCounter;
    /* 0xE4 */ bool mIsChaseMoreBrake;
    /* 0xE8 */ DodoryuChaseParam* mChaseParam;
    /* 0xEC */ bool mIsPlayerStaggering;
};
