#pragma once

#include "Game/Boss/Dodoryu.hpp"
#include "Game/Boss/DodoryuStateBase.hpp"

class JMapInfoIter;

struct DodoryuChaseParam {
    /* 0x00 */ s32 _0;
    /* 0x04 */ f32 _4;
    /* 0x08 */ f32 _8;
    /* 0x0C */ f32 _C;
    /* 0x10 */ f32 _10;
    /* 0x14 */ f32 _14;
    /* 0x18 */ s32 _18;
    /* 0x1C */ f32 _1C;
    /* 0x20 */ f32 _20;
    /* 0x24 */ f32 _24;
    /* 0x28 */ f32 _28;
    /* 0x2C */ s32 _2C;
    /* 0x30 */ s32 _30;
    /* 0x34 */ f32 _34;
    /* 0x38 */ f32 _38;
    /* 0x3C */ f32 _3C;
    /* 0x40 */ f32 _40;
    /* 0x44 */ f32 _44;
    /* 0x48 */ f32 _48;
    /* 0x4C */ s32 _4C;
    /* 0x50 */ s32 _50;
    /* 0x54 */ s32 _54;
    /* 0x58 */ s32 _58;
    /* 0x5C */ f32 _5C;
    /* 0x60 */ s32 _60;
    /* 0x64 */ s32 _64;
    /* 0x68 */ f32 _68;
    /* 0x6C */ f32 _6C;
    /* 0x70 */ f32 _70;
    /* 0x74 */ s32 _74;
    /* 0x78 */ s32 _78;
    /* 0x7C */ s32 _7C;
    /* 0x80 */ s32 _80;
    /* 0x84 */ f32 _84;
    /* 0x88 */ f32 _88;
    /* 0x8C */ f32 _8C;
    /* 0x90 */ s32 _90;
    /* 0x94 */ s32 _94;
    /* 0x98 */ u32 _98;
    /* 0x9C */ u8 _9C;
    /* 0x9D */ u8 _9D;
    /* 0x9E */ u8 _9E;
    /* 0x9F */ u8 _9F;
    /* 0xA0 */ f32 _A0;
    /* 0xA4 */ f32 _A4;
    /* 0xA8 */ f32 _A8;
    /* 0xAC */ f32 _AC;
    /* 0xB0 */ s32 _B0;
    /* 0xB4 */ s32 _B4;
    /* 0xB8 */ f32 _B8;
    /* 0xBC */ s32 _BC;
    /* 0xC0 */ s32 _C0;
    /* 0xC4 */ s32 _C4;
    /* 0xC8 */ s32 _C8;
    /* 0xCC */ DodoryuAnimSet _CC;
    /* 0xE0 */ DodoryuAnimSet _E0;
    /* 0xF4 */ DodoryuAnimSet _F4;
    /* 0x108 */ DodoryuAnimSet _108;
    /* 0x11C */ DodoryuAnimSet _11C;
    /* 0x130 */ DodoryuAnimSet _130;
    /* 0x144 */ DodoryuAnimSet _144;
    /* 0x158 */ DodoryuAnimSet _158;
    /* 0x16C */ DodoryuAnimSet _16C;
    /* 0x180 */ DodoryuAnimSet _180;
    /* 0x194 */ DodoryuAnimSet _194;
    /* 0x1A8 */ DodoryuAnimSet _1A8;
    /* 0x1BC */ DodoryuAnimSet _1BC;
    /* 0x1D0 */ DodoryuAnimSet _1D0;
    /* 0x1E4 */ DodoryuAnimSet _1E4;
    /* 0x1F8 */ DodoryuAnimSet _1F8;
    /* 0x20C */ DodoryuAnimSet _20C;
    /* 0x220 */ DodoryuAnimSet _220;
    /* 0x234 */ DodoryuAnimSet _234;
    /* 0x248 */ DodoryuAnimSet _248;
};

class DodoryuStateLv2 : public DodoryuStateBase {
public:
    DodoryuStateLv2(Dodoryu*, DodoryuChaseParam*, const char*);

    virtual void init(const JMapInfoIter&);
    virtual void control();

    virtual void start();
    virtual void catchAttackSensor(HitSensor*, HitSensor*);
    virtual void catchHipDrop();
    virtual bool catchPlayerAttack(u32, HitSensor*, HitSensor*);
    virtual void catchStartClipped();
    virtual void catchSendPlayerFlying(HitSensor*, HitSensor*);

    void exeStart();
    void exeReadyChase();
    void endReadyChase();
    void exeChaseHide();
    void endChaseHide();
    void exeReadyAppear();
    void endReadyAppear();
    void exeAppearSign();
    void exeChaseAppearStart();
    void endChaseAppearStart();
    void exeChaseAppear();
    void endChaseAppear();
    void exeChaseAppearEnd();
    void endChaseAppearEnd();
    void exeJumpOut();
    void exeEscape();
    void endEscape();
    void exeEscapeJump();
    void endEscapeJump();
    void exeRecover();
    void exeDive();
    void endDive();
    void exeKnockDown();
    void exeLaugh();
    void exeLaughEnd();
    void endLaughEnd();
    void exeFindPos();
    void exeHideAttack();
    void exeChaseMoreStart();
    void exeChaseMore();
    void endChaseMore();
    void exeChaseMoreEnd();

    void knockOver();
    bool isEnableToCatchHipDrop() const;
    bool isDown() const;
    bool isAttackableNerve() const;
    bool tryShiftToChaseAppear();
    bool tryShiftToChaseAppearEnd();
    bool isEscapeEnd() const;
    void updateReadyChaseShake();
    void updateChaseHideShake();
    void updateHideShake();
    void updateDiveShake();
    void calcRandomVelocity(s32);
    void keepVerticalizedVelocity();
    void attackStrongToDir(HitSensor*, HitSensor*);
    void hideJump();
    bool tryToShiftAppearSign();
    void determinChaseMoreAccelCounter();
    void determinChaseMoreBrakeCounter();
    void turnToward(const TVec3f&, f32);
    void addVelocity(bool);
    void calcLimitedRotateMtx(TPos3f*, const TVec3f&, const TVec3f&, f32);
    bool isReflectSpinAttack() const;
    void shiftChaseUnderground();
    void shiftChaseExposingHead();
    void shiftChaseExposingBust();
    void shiftChaseInAnger();
    void shiftHideAttack();
    void startAnim(const DodoryuAnimSet&);
    void startBtk(const DodoryuAnimSet&);
    void startBrk(const DodoryuAnimSet&);
    void startBva(const DodoryuAnimSet&);
    void startLeadHillBck(const DodoryuAnimSet&);

    /* 0x90 */ void* _90;
    /* 0x94 */ TVec3f _94;
    /* 0xA0 */ TVec3f _A0;
    /* 0xAC */ f32 _AC;
    /* 0xB0 */ f32 _B0;
    /* 0xB4 */ f32 _B4;
    /* 0xB8 */ s32 _B8;
    /* 0xBC */ s32 _BC;
    /* 0xC0 */ s32 mAppearCount;
    /* 0xC4 */ s32 _C4;
    /* 0xC8 */ s32 _C8;
    /* 0xCC */ s32 _CC;
    /* 0xD0 */ f32 _D0;
    /* 0xD4 */ f32 _D4;
    /* 0xD8 */ f32 _D8;
    /* 0xDC */ s32 mFindPosCounter;
    /* 0xE0 */ s32 _E0;
    /* 0xE4 */ bool _E4;
    /* 0xE8 */ DodoryuChaseParam* mChaseParam;
    /* 0xEC */ bool mPlayerStaggering;
};
